{
  "npc": {
    "name": "Sihong",
    "portrait": "portrait1",
    "dialogue": [
      "Hi there! I'm Sihong Liu, an Applied Scientist at AWS Training & Certification, focusing on LLM Evaluation and multi-modal content generation.",
      "Each house in this village tells a part of my story — About Me, Work Experience, and Education. Walk up to one and press Space to enter!",
      "Feel free to explore! Use arrow keys, WASD, or click to move around."
    ],
    "dialogueShort": [
      "Welcome back! Feel free to explore the village — walk up to any house and press Space to enter."
    ]
  },
  "houses": {
    "aboutMe": {
      "title": "About Me",
      "entries": [
        {
          "title": "Introduction",
          "description": "Applied Scientist with 12+ years of experience in AI/ML and data science. Proven track record of shipping production ML systems at Amazon, Microsoft, and IBM — from LLM evaluation frameworks and recommendation engines to trust & safety platforms serving millions of users."
        },
        {
          "title": "Core Expertise",
          "description": "LLM Evaluation & Alignment, Multi-modal Content Generation, Retrieval-Augmented Generation (RAG), NLP & Transformer Models, Recommendation Systems, Trust & Safety, User Growth & Engagement, Experimentation & A/B Testing."
        },
        {
          "title": "Patent & Recognition",
          "description": "Intelligent File Recommendation (Microsoft) — Patented ML-driven document recommendation system combining LightGBM and deep neural networks. Awarded Best AI Features at Microsoft Research 2018."
        }
      ]
    },
    "workExperience": {
      "title": "Work Experience",
      "entries": [
        {
          "company": "Amazon Web Services (AWS)",
          "role": "Applied Scientist — Training & Certification",
          "period": "2024 – Present",
          "highlights": [
            "Architecting LLM evaluation frameworks to measure and improve content quality across AWS certification programs",
            "Building end-to-end multi-modal content generation pipelines that automate training material creation at scale",
            "Driving AI-first strategy for AWS learning content, reducing manual authoring effort while improving learner outcomes"
          ]
        },
        {
          "company": "Amazon",
          "role": "Applied Scientist — Alexa AGI Team",
          "period": "Jul 2022 – 2024",
          "highlights": [
            "Led annotation reduction initiative for Alexa AI, cutting labeling costs while maintaining model accuracy for monetization features",
            "Unified multiple recommendation models into a single personalized system, improving Alexa user engagement",
            "Shipped next-generation LLM capabilities for Alexa, contributing to conversational AI and knowledge grounding",
            "Coordinated cross-team efforts on model-driven advertising, establishing long-term partnership frameworks"
          ]
        },
        {
          "company": "Microsoft",
          "role": "Senior Applied Scientist — Security & Compliance",
          "period": "Jun 2019 – Jul 2022",
          "highlights": [
            "Tech lead for trust & safety platform, deploying behavioral ML models protecting enterprise users across M365",
            "Developed Word2Vec and LSTM-based classifiers for phishing and spam detection at scale",
            "Pioneered GPT-3 usage for synthetic training data generation and keyword extraction (RAKE, TextRank, KeyBERT)",
            "Fine-tuned transformer-based classifiers for content moderation and built ML interpretability dashboards for stakeholder trust"
          ]
        },
        {
          "company": "Microsoft",
          "role": "Data Scientist — Office Growth",
          "period": "Feb 2016 – May 2019",
          "highlights": [
            "Designed and operated A/B experimentation frameworks informing Office product launch decisions across millions of users",
            "Invented parametric method for false positive rate control in scorecard segmentation, adopted org-wide",
            "Built patented document recommendation engine (LightGBM + DNN with LambdaRank) — Best AI Features Award, MSR 2018",
            "Developed Office 365 renewal propensity and customer lifetime value models, driving targeted marketing campaigns"
          ]
        },
        {
          "company": "IBM",
          "role": "Data Scientist — Global Business Services",
          "period": "Aug 2013 – Jan 2016",
          "highlights": [
            "Delivered predictive ML models for customer loyalty, churn prevention, and market basket analysis across enterprise clients",
            "Built time series forecasting systems supporting business planning and resource allocation decisions",
            "Received Performance Excellence Award (2015) for outstanding client delivery and analytical impact"
          ]
        }
      ]
    },
    "education": {
      "title": "Education",
      "entries": [
        {
          "degree": "MS in Data Science",
          "institution": "DePaul University, Chicago, IL",
          "year": "2013",
          "details": "Research Assistant — Conducted statistical programming on large-scale datasets, database optimization, and ML modeling using SAS and Python."
        },
        {
          "degree": "BS in Statistics & BA in Economics",
          "institution": "Guangdong University of Foreign Studies, China",
          "year": "2011",
          "details": "Dual degree combining quantitative rigor with economic theory — strong foundations in statistical analysis, probability, and econometric modeling."
        }
      ]
    }
  }
}
